Revit 2027 API
BuiltInFailures.WallFailures.FaceWallFailedToMake Property
 Can't make Face Wall shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId FaceWallFailedToMake { get; }
Public Shared ReadOnly Property FaceWallFailedToMake As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ FaceWallFailedToMake {
	FailureDefinitionId^ get ();
}
static member FaceWallFailedToMake : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.WallFailures Class
Autodesk.Revit.DB Namespace